[
    {
        "block_number": 1,
        "subject": "History",
        "title": "XVII век в истории России",
        "content": "XVII век в истории России начался с Смутного времени (1598–1613) — периода глубокого политического, социального и экономического кризиса. Причинами Смуты стали пресечение династии Рюриковичей, борьба за власть, иностранная интервенция и массовые народные выступления. Завершилась Смута избранием на престол Михаила Фёдоровича Романова в 1613 году, что положило начало новой династии. В XVII веке происходило укрепление самодержавной власти и централизации государства. Важнейшим законодательным актом стало Соборное уложение 1649 года, которое окончательно закрепило крепостное право, усилило зависимость крестьян от помещиков и закрепило сословную структуру общества. Социальная напряжённость выливалась в крупные народные восстания, крупнейшим из которых стала крестьянская война под руководством Степана Разина (1670–1671). Внешняя политика России была направлена на расширение территории и укрепление позиций: в результате Переяславской рады 1654 года Левобережная Украина вошла в состав Российского государства."
    },
    {
        "block_number": 2,
        "subject": "History",
        "title": "XVIII век (Петровские реформы и Российская империя)",
        "content": "XVIII век стал временем кардинальной модернизации России, связанной прежде всего с деятельностью Петра I. Его реформы затронули все сферы жизни: государственное управление, армию, флот, экономику, образование и культуру. Целью реформ было превращение России в сильную европейскую державу. В ходе Северной войны (1700–1721) Россия одержала победу над Швецией и получила выход к Балтийскому морю. В 1721 году Россия была официально провозглашена империей, а Пётр I принял титул императора. Новой столицей стал Санкт-Петербург, символ «окна в Европу». Во второй половине XVIII века политика просвещённого абсолютизма проводилась при Екатерине II. Она сочетала идеи Просвещения с сохранением самодержавной власти и крепостного строя. Усиление крепостничества привело к крупнейшему крестьянскому восстанию под предводительством Емельяна Пугачёва (1773–1775), показавшему глубину социальных противоречий в обществе."
    },
    {
        "block_number": 3,
        "subject": "History",
        "title": "XIX век (Реформы и противоречия развития)",
        "content": "XIX век начался для России Отечественной войной 1812 года, в ходе которой была отражена агрессия наполеоновской Франции. Победа усилила международный авторитет России, но внутренние противоречия сохранились. В 1825 году произошло восстание декабристов, ставшее первым открытым выступлением против самодержавия. Несмотря на поражение, оно оказало большое влияние на формирование общественно-политической мысли. Ключевым событием века стала отмена крепостного права в 1861 году при императоре Александр II. Это была важнейшая социально-экономическая реформа, открывшая путь к развитию капиталистических отношений. Однако непоследовательность реформ сохранила многие проблемы. Поражение в Крымской войне (1853–1856) показало экономическую и военную отсталость России. Во второй половине века при Александре III начался период контрреформ, направленных на усиление самодержавия и ограничение либеральных преобразований."
    },
    {
        "block_number": 4,
        "subject": "History",
        "title": "XX век (Революции, СССР и распад государства)",
        "content": "XX век стал самым драматичным периодом в истории России. В 1917 году произошли Февральская и Октябрьская революции, приведшие к падению монархии и приходу к власти большевиков. В 1922 году было образовано Союз Советских Социалистических Республик (СССР). В 1920-е годы проводилась Новая экономическая политика (НЭП), сочетавшая элементы плановой и рыночной экономики. В 1930-е годы начались индустриализация и коллективизация, сопровождавшиеся массовыми репрессиями. Ключевым событием века стала Великая Отечественная война 1941–1945 гг., в которой СССР одержал победу над нацистской Германией. После войны страна стала одной из мировых сверхдержав. Во второй половине века СССР столкнулся с системным кризисом. В период правления М. С. Горбачёва проводилась перестройка, направленная на реформирование политической и экономической системы. Итогом кризиса стал распад СССР в 1991 году, завершивший советский этап российской истории."
    },
    {
        "block_number": 5,
        "subject": "History",
        "title": "XXI век",
        "content": "XXI век для России начался с избрания Владимира Путина президентом в 2000 году. Этот период характеризуется стабилизацией политической системы, экономическим ростом и восстановлением международного влияния России. Были проведены реформы в области управления, экономики и социальной сферы. Россия продолжает играть важную роль на мировой арене, участвуя в решении глобальных проблем и отстаивая свои национальные интересы."
    }
]