[
    {
        "block_number": 1,
        "subject": "Chemistry",
        "title": "Атомное строение вещества и периодический закон",
        "content": "Все вещества состоят из атомов — наименьших частиц химического элемента, сохраняющих его свойства. Атом состоит из ядра и электронной оболочки. В ядре находятся протоны, имеющие положительный заряд, и нейтроны, не имеющие заряда. Вокруг ядра движутся электроны с отрицательным зарядом. Число протонов в ядре атома определяет химический элемент и называется порядковым номером. В нейтральном атоме число электронов равно числу протонов. Масса атома в основном сосредоточена в ядре. Периодический закон, открытый Д. И. Менделеевым, устанавливает, что свойства химических элементов и их соединений находятся в периодической зависимости от заряда ядра атома. Периодическая система позволяет предсказывать свойства элементов, их валентность и характер химических реакций.",
        "image": "chemistry_block1.png"
    },
    {
        "block_number": 2,
        "subject": "Chemistry",
        "title": "Химическая связь и строение молекул",
        "content": "Химическая связь — это взаимодействие между атомами, приводящее к образованию молекул, ионов или кристаллических решёток. Образование связи сопровождается понижением энергии системы, что делает молекулу устойчивой. Существует несколько основных типов химической связи. Ковалентная связь образуется за счёт общих электронных пар и характерна для неметаллов. Она может быть полярной и неполярной. Ионная связь возникает между атомами с большой разницей электроотрицательностей и обусловлена электростатическим притяжением ионов. Металлическая связь характерна для металлов и объясняет их электропроводность и пластичность. Тип химической связи определяет физические свойства вещества, такие как температура плавления, твёрдость и растворимость.",
        "image": "chemistry_block2.png"
    },
    {
        "block_number": 3,
        "subject": "Chemistry",
        "title": "Стехиометрия и химические формулы",
        "content": "Стехиометрия — раздел химии, изучающий количественные соотношения между реагирующими веществами и продуктами реакций. Она основана на законе сохранения массы и законе постоянства состава. Химическая формула показывает, какие элементы входят в состав вещества и сколько атомов каждого элемента содержится в его молекуле или формульной единице. Индексы в формуле указывают число атомов соответствующего элемента. Одним из ключевых понятий является моль — количество вещества, содержащее структурные частицы (атомы, молекулы или ионы). Использование молей позволяет выполнять расчёты масс веществ, объёмов газов и выходов реакций, что имеет большое значение в лабораторной и промышленной практике."
    },
    {
        "block_number": 4,
        "subject": "Chemistry",
        "title": "Химические реакции и их закономерности",
        "content": "Химическая реакция — это процесс, в ходе которого одни вещества (реагенты) превращаются в другие (продукты реакции). При этом происходит перераспределение электронов и изменение химических связей. Все химические реакции подчиняются закону сохранения массы, согласно которому суммарная масса реагентов равна массе продуктов реакции. Это означает, что атомы в ходе реакции не исчезают и не возникают заново. По тепловому эффекту реакции делятся на экзотермические, сопровождающиеся выделением энергии, и эндотермические, протекающие с её поглощением. Признаками химических реакций могут быть выделение газа, образование осадка, изменение цвета или температуры системы."
    },
    {
        "block_number": 5,
        "subject": "Chemistry",
        "title": "Растворы и кислотно-основные свойства",
        "content": "Растворы — это однородные системы, состоящие из растворителя и растворённого вещества. В водных растворах растворителем чаще всего является вода. Кислотно-основные свойства растворов характеризуются величиной pH, которая показывает концентрацию ионов водорода. Значение pH позволяет определить характер среды: кислую, нейтральную или щелочную. Кислоты в растворе диссоциируют с образованием ионов водорода, основания — с образованием гидроксид-ионов. Соли образуются при взаимодействии кислот и оснований. Понимание свойств растворов имеет важное значение для химии, биологии, медицины и экологии."
    }
]