[
    {
        "block_number": 1,
        "subject": "Math",
        "title": "Линейная алгебра",
        "content": "Линейная алгебра изучает векторы, матрицы, линейные пространства и системы линейных уравнений. Вектор представляет собой направленный отрезок, характеризующийся величиной и направлением, и может быть представлен координатами в пространстве. Матрица — это прямоугольная таблица чисел, которая используется для представления линейных преобразований и систем уравнений. Набор векторов называется линейно независимым, если ни один вектор нельзя выразить через остальные. Квадратная матрица называется обратимой, если её детерминант не равен нулю, и для неё существует обратная матрица, позволяющая решать системы линейных уравнений. Линейная алгебра является основой многих областей науки и техники, включая компьютерную графику, физику и экономику.",
        "image": "math_block1.png"
    },
    {
        "block_number": 2,
        "subject": "Math",
        "title": "Функции и пределы",
        "content": "Функция — это правило, которое каждому значению из области определения ставит в соответствие одно значение из области значений. Область определения функции включает все допустимые значения аргумента, а область значений — все возможные значения функции. Предел функции при x стремящемся к a показывает, к какому значению стремится функция, когда аргумент приближается к a. Последовательности также могут иметь предел: если члены последовательности стремятся к числу, она называется сходящейся. Пределы позволяют исследовать поведение функции в окрестности точки и на бесконечности, и являются основой дифференцирования и интегрирования.",
        "image": "math_block2.png"
    },
    {
        "block_number": 3,
        "subject": "Math",
        "title": "Производные и дифференцирование",
        "content": "Производная функции в точке показывает скорость изменения функции относительно аргумента. Производные используются для анализа монотонности функций, нахождения экстремумов и исследования выпуклости графиков. Основные правила дифференцирования включают формулы для степенных функций, экспоненты и тригонометрических функций. Критическая точка функции — это точка, где производная равна нулю или не существует, и она может быть минимумом, максимумом или точкой перегиба. Дифференцирование широко применяется в физике, экономике и инженерных задачах для анализа изменений величин."
    },
    {
        "block_number": 4,
        "subject": "Math",
        "title": "Интегралы и первообразные",
        "content": "Интеграл — это обратная операция к дифференцированию. Неопределённый интеграл представляет собой семейство первообразных функции и включает произвольную константу интегрирования. Определённый интеграл функции на интервале от a до b равен площади под графиком функции на этом интервале. Интегралы применяются для вычисления площади, объёма, длины кривой, а также для решения физических задач, таких как нахождение работы, массы или энергии."
    },
    {
        "block_number": 5,
        "subject": "Math",
        "title": "Последовательности и ряды",
        "content": "Последовательность — это упорядоченный набор чисел. Арифметическая прогрессия — это последовательность, в которой разность между соседними членами постоянна. Геометрическая прогрессия — это последовательность, в которой отношение соседних членов постоянно. Суммы членов прогрессий вычисляются по соответствующим формулам: для арифметической прогрессии сумма первых n членов равна n, умноженному на полусумму первого и n-го членов, а для геометрической прогрессии сумма первых n членов равна первому члену, умноженному на частное 1 минус q^n, делённое на 1 минус q, где q — знаменатель прогрессии. Последовательности и ряды применяются для анализа функций, аппроксимации и решения практических задач в физике и экономике."
    }
]